untestedTutorials/pimpleFlasks/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

domainSize  0.2;
domainSizeM  -0.2;

vertices
(
    ($domainSizeM $domainSizeM $domainSizeM)
    ($domainSize $domainSizeM  $domainSizeM)
    ($domainSize  $domainSize  $domainSizeM)
    ($domainSizeM  $domainSize $domainSizeM)
    ($domainSizeM $domainSizeM 0.4)
    ($domainSize $domainSizeM 0.4)
    ($domainSize  $domainSize 0.4)
    ($domainSizeM  $domainSize 0.4)
);

blocks
(
   // hex (0 1 2 3 4 5 6 7) (1 20 50) simpleGrading (1 1 1)
   // hex (0 1 2 3 4 5 6 7) (1 80 200) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (40 40 60) simpleGrading (1 1 1)
);

boundary
(	
    // frontAndBack
    // {
    //     type empty;
    //     faces
    //     (

    //     );
    // }
	// -- inlet into geometry
    inlet
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 4 7 3)
            (2 6 5 1)
			(0 3 2 1)
            
        );
    }
	// -- outlet from geometry
    outlet
    {
        type patch;
        faces
        (
			(4 5 6 7)
        );
    }
);

// ************************************************************************* //
