untestedTutorials/pimpleFlasks/0.org/CO2
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      CO2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0;
    }
    "(sphere|sphere2|cyl)"
    {
        type            zeroGradient;
    }

    "(outlet|sides)"
    {
        type        zeroGradient;
    }
        frontAndBack
    {
        type            empty;
    }
        "sym"
    {
        type        symmetry;
    }
}

// ************************************************************************* //
