untestedTutorials/pimpleFlasks/0.org/UD
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField	uniform	(0 0 0.0);

boundaryField
{
    inlet
    {
        // type            fixedValue;
	    // value	uniform (0 0 0.0);

        type            zeroGradient;
    }
    outlet
    {
        // type            inletOutlet;
        type            zeroGradient;
        // value           $internalField;
        // inletValue      uniform (0 0 0);
    }
    "(walls|sides)"
    {
        type            noSlip;
    }
        frontAndBack
    {
        type            empty;
    }
        "sym"
    {
        type        symmetry;
    }
    "(sphere|sphere2|cyl)"
    {
        type            noSlip;
    }
}


// ************************************************************************* //
