untestedTutorials/pimpleFlasks/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|Phi|rho)"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            relTol          0.01;
            smoother        symGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 400;
            agglomerator    faceAreaPair;
            processorAgglomerator   procFaces;
            nAgglomeratingCells     10;
            mergeLevels             1;
        }
        tolerance       1e-07;
        relTol          0.01;
    }
    "(pFinal|rhoFinal)"
    {
        solver          PCG;
        preconditioner
        {
            preconditioner  GAMG;
            tolerance       1e-07;
            // relTol          0.05;
            smoother        symGaussSeidel;
            nPreSweeps      0;
            nPostSweeps     2;
            nFinestSweeps   2;
            cacheAgglomeration true;
            nCellsInCoarsestLevel 400;
            agglomerator    faceAreaPair;
            processorAgglomerator   procFaces;
            nAgglomeratingCells     10;
            mergeLevels             1;
        }
        tolerance       1e-07;
        // relTol          0.01;
    }

    "(U)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
    }
    "(UFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        // relTol          0.01;
    }

    // "(T|TFinal)"
    // {
    //     solver          PBiCGStab;
    //     preconditioner  DILU;
    //     tolerance       1e-08;
    //     relTol          0.01;
    // }
    // "(T|TSolid)"
    // {   
    //     solver          PBiCGStab;
    //     preconditioner  none;
    //     tolerance       1e-09;
    //     relTol          0.01;
    // }
    // "(TFinal|TSolidFinal)"
    // {   
    //     solver          PBiCGStab;
    //     preconditioner  none;
    //     tolerance       1e-09;
    //     // relTol          0.01;
    // }
    
    "(CO|O2|CO2|N2O|N2|NO|H2|methanol|acetone)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        relTol          0.01;
    } 
    "(COFinal|H2Final|O2Final|CO2Final|N2OFinal|N2Final|NOFinal|H2Final|methanolFinal|acetoneFinal)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-07;
        // relTol          0.01;
    }   

}

PIMPLE
{
    nUCorrectors 0;                 // 0 --> explicit presure
    nConcCorrectors 1;              // n of concentration calculations for each specie
    nTempCorrectors 0;	            // n of temperature corrections 
    nNonOrthogonalCorrectors 2;     // n of presure corrections (not necessary on this mesh)
    nOuterCorrectors 20;             // n of outerCorrectors for pimple (1 --> PISO)
    consistent no;
    
    debug 0;
    
    outerCorrectorResidualControl
    {
        // p           1e-4;
        // U           1e-4;
        // T           1e-4;
        // "(CO|NO|O2|N2O|CO2)"    1e-4;
        U
        {
                tolerance  1e-5;
                relTol      0;
        }
        p
        {
                tolerance  5e-4;
                relTol      0;
        }
        T 
        {
                tolerance  1e-8;
                relTol      0;
        }
        N2
        {
                tolerance  1e-5;
                relTol      0;
        }
    }
}

// relaxationFactors
// {
//     fields
//     {
//         p           0.1;
//         U           0.2;
//         // T           0.5;
//         // "(CO|O2|CO2|H2)" 	 0.1;
//     }
//     equations
//     {
//         "(p|U)" 0.9;
//         "(T)" 0.98;
//         "(CO|O2|CO2|H2)" 	 0.98;
//     }
// }
// ************************************************************************* //
